_site/app/controllers/widgets_controller.rb

  def index
    @widgets = Widget.all
---
SELECT "widgets".* FROM "widgets"

  def create
    @widget = Widget.new(widget_params)

    respond_to do |format|
      if @widget.save
---
INSERT INTO "widgets" ("style", "color", "runcible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["style", "j;lj;"], ["color", "Red"], ["runcible", 1], ["created_at", "2021-01-31 08:02:11.281856"], ["updated_at", "2021-01-31 08:02:11.281856"]]

    def set_widget
      @widget = Widget.find(params[:id])
---
SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]